[Killed] ConditionalExpression
src/BaseConverter.ts:2:26
 function convert_decimal_to_binary(n: number): string {
-    const sign: string = n < 0 ? '1' : '0';
+    const sign: string = false ? '1' : '0';
 
     let absoluteNumber: number = Math.abs(n);
killedBy: Base Converter Tests Should convert negative decimal to binary.
statusReason: Converted number was not as expected!: expected '01000' to equal '11000'

[Killed] ConditionalExpression
src/BaseConverter.ts:2:26
 function convert_decimal_to_binary(n: number): string {
-    const sign: string = n < 0 ? '1' : '0';
+    const sign: string = true ? '1' : '0';
 
     let absoluteNumber: number = Math.abs(n);
killedBy: Base Converter Tests Should convert positive decimal to binary.
statusReason: Converted number was not as expected!: expected '11000' to equal '01000'

[Killed] ConditionalExpression
src/BaseConverter.ts:7:11
     let absoluteNumber: number = Math.abs(n);
     let convertedDecimal = '';
 
-    while(absoluteNumber > 0) {
+    while(false) {
         const reminder: number = absoluteNumber % 2;
         convertedDecimal += reminder.toString();
killedBy: Base Converter Tests Should convert positive decimal to binary.
statusReason: Converted number was not as expected!: expected '0' to equal '01000'

[Killed] EqualityOperator
src/BaseConverter.ts:7:11
     let absoluteNumber: number = Math.abs(n);
     let convertedDecimal = '';
 
-    while(absoluteNumber > 0) {
+    while(absoluteNumber <= 0) {
         const reminder: number = absoluteNumber % 2;
         convertedDecimal += reminder.toString();
killedBy: Base Converter Tests Should convert positive decimal to binary.
statusReason: Converted number was not as expected!: expected '0' to equal '01000'

[Killed] ArithmeticOperator
src/BaseConverter.ts:8:34
     let convertedDecimal = '';
 
     while(absoluteNumber > 0) {
-        const reminder: number = absoluteNumber % 2;
+        const reminder: number = absoluteNumber * 2;
         convertedDecimal += reminder.toString();
         absoluteNumber = Math.floor(absoluteNumber / 2);
killedBy: Base Converter Tests Should convert positive decimal to binary.
statusReason: Converted number was not as expected!: expected '024861' to equal '01000'

[Timeout] ArithmeticOperator
src/BaseConverter.ts:10:37
     while(absoluteNumber > 0) {
         const reminder: number = absoluteNumber % 2;
         convertedDecimal += reminder.toString();
-        absoluteNumber = Math.floor(absoluteNumber / 2);
+        absoluteNumber = Math.floor(absoluteNumber * 2);
     }
     convertedDecimal += sign;

[Killed] StringLiteral
src/BaseConverter.ts:13:23
         absoluteNumber = Math.floor(absoluteNumber / 2);
     }
     convertedDecimal += sign;
-    const separator = '';
+    const separator = "Stryker was here!";
     return convertedDecimal.split(separator).reverse().join(separator);
 }
killedBy: Base Converter Tests Should convert positive decimal to binary.
statusReason: Converted number was not as expected!: expected '00010' to equal '01000'

[Killed] MethodExpression
src/BaseConverter.ts:14:12
     }
     convertedDecimal += sign;
     const separator = '';
-    return convertedDecimal.split(separator).reverse().join(separator);
+    return convertedDecimal.split(separator).join(separator);
 }
 
killedBy: Base Converter Tests Should convert positive decimal to binary.
statusReason: Converted number was not as expected!: expected '00010' to equal '01000'

[Killed] EqualityOperator
src/BaseConverter.ts:19:9
 
 function convert_binary_to_decimal(binaryNumber: string): number {
     let multiplier: number;
-    if (binaryNumber.at(0) === '1') {
+    if (binaryNumber.at(0) !== '1') {
         multiplier = -1;
     } else {
killedBy: Base Converter Tests Should convert negative binary to decimal.
statusReason: Converted number was not as expected!: expected 8 to equal -8

[Killed] ConditionalExpression
src/BaseConverter.ts:19:9
 
 function convert_binary_to_decimal(binaryNumber: string): number {
     let multiplier: number;
-    if (binaryNumber.at(0) === '1') {
+    if (false) {
         multiplier = -1;
     } else {
killedBy: Base Converter Tests Should convert negative binary to decimal.
statusReason: Converted number was not as expected!: expected 8 to equal -8

[Killed] UnaryOperator
src/BaseConverter.ts:20:22
 function convert_binary_to_decimal(binaryNumber: string): number {
     let multiplier: number;
     if (binaryNumber.at(0) === '1') {
-        multiplier = -1;
+        multiplier = +1;
     } else {
         multiplier = 1;
killedBy: Base Converter Tests Should convert negative binary to decimal.
statusReason: Converted number was not as expected!: expected 8 to equal -8

[Killed] MethodExpression
src/BaseConverter.ts:24:36
     } else {
         multiplier = 1;
     }
-    const absoluteBinary: string = binaryNumber.slice(1);
+    const absoluteBinary: string = binaryNumber;
     const absoluteDecimal: number = absoluteBinary.split('').reverse()
         .reduceRight((_, curr, index) => _ + Math.pow(2, index) * parseInt(curr), 0);
killedBy: Base Converter Tests Should convert negative binary to decimal.
statusReason: Converted number was not as expected!: expected -24 to equal -8

[Killed] MethodExpression
src/BaseConverter.ts:25:37
         multiplier = 1;
     }
     const absoluteBinary: string = binaryNumber.slice(1);
-    const absoluteDecimal: number = absoluteBinary.split('').reverse()
+    const absoluteDecimal: number = absoluteBinary.split('')
         .reduceRight((_, curr, index) => _ + Math.pow(2, index) * parseInt(curr), 0);
     return multiplier * absoluteDecimal;
killedBy: Base Converter Tests Should convert negative binary to decimal.
statusReason: Converted number was not as expected!: expected -1 to equal -8

[Killed] ArithmeticOperator
src/BaseConverter.ts:26:42
     }
     const absoluteBinary: string = binaryNumber.slice(1);
     const absoluteDecimal: number = absoluteBinary.split('').reverse()
-        .reduceRight((_, curr, index) => _ + Math.pow(2, index) * parseInt(curr), 0);
+        .reduceRight((_, curr, index) => _ - Math.pow(2, index) * parseInt(curr), 0);
     return multiplier * absoluteDecimal;
 }
killedBy: Base Converter Tests Should convert negative binary to decimal.
statusReason: Converted number was not as expected!: expected 8 to equal -8

[Killed] ArithmeticOperator
src/BaseConverter.ts:26:46
     }
     const absoluteBinary: string = binaryNumber.slice(1);
     const absoluteDecimal: number = absoluteBinary.split('').reverse()
-        .reduceRight((_, curr, index) => _ + Math.pow(2, index) * parseInt(curr), 0);
+        .reduceRight((_, curr, index) => _ + Math.pow(2, index) / parseInt(curr), 0);
     return multiplier * absoluteDecimal;
 }
killedBy: Base Converter Tests Should convert negative binary to decimal.
statusReason: Converted number was not as expected!: expected -Infinity to equal -8

[Killed] ArithmeticOperator
src/BaseConverter.ts:27:12
     const absoluteBinary: string = binaryNumber.slice(1);
     const absoluteDecimal: number = absoluteBinary.split('').reverse()
         .reduceRight((_, curr, index) => _ + Math.pow(2, index) * parseInt(curr), 0);
-    return multiplier * absoluteDecimal;
+    return multiplier / absoluteDecimal;
 }
 
killedBy: Base Converter Tests Should convert negative binary to decimal.
statusReason: Converted number was not as expected!: expected -0.125 to equal -8
